### 1-2 파이썬에서 텍스트 파일과 엑셀 파일 읽기 -pandas

In [2]:
import pandas as pd
#모듈을 읽어오는 명령어 import

In [3]:
CCTV_Seoul = pd.read_csv('data/01. CCTV_in_Seoul.csv', encoding = 'utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [5]:
CCTV_Seoul.columns
#첫재줄을 불러옴 columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [6]:
CCTV_Seoul.columns[0]

'기관명'

In [8]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace = True)
CCTV_Seoul.head()
#columns 이름을 바꾸는 명령어 rename

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [10]:
pop_Seoul = pd.read_excel('data/01. population_in_Seoul.xls', encoding='utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [13]:
pop_Seoul = pd.read_excel('data/01. population_in_Seoul.xls',
                         header =2,
                         usecols = 'B,D,G,J,N',
                         encoding='utf_8') #header =2 는 세번째 줄부터 읽어옴, parse_cols는 해당 열만 읽어옴(후에 usecols로 바뀜)
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [14]:
pop_Seoul.rename(columns = {pop_Seoul.columns[0]:'구별',
                           pop_Seoul.columns[1]:'인구수',
                           pop_Seoul.columns[2]:'한국인',
                           pop_Seoul.columns[3]:'외국인',
                           pop_Seoul.columns[4]:'고령자'},inplace = True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

### 1-3 pandas 기초 익히기

In [15]:
import pandas as pd
import numpy as np

In [17]:
s = pd.Series([1,3,5,np.nan,6,8]) #pandas의 데이터 유형 중 기초가 되는 것이 Series, 대괄호로 만다는 파이썬의 list 데이터로 만들 수 있다.
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [20]:
dates= pd.date_range('20130101', periods=6) #pandas에 존재하는 날짜형 데이터 date_range, periods로 기간 설정
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [24]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns = ['A','B','C','D']) 
#6행 4열의 Random 변수를 만들고 columns과 index에 값을 넣음
df

                   A         B         C         D
2013-01-01  1.758777  0.460934  0.749075 -0.173135
2013-01-02 -0.514580 -0.384342  0.600977  0.726372
2013-01-03 -1.088440 -1.172281  0.664323  0.237316
2013-01-04 -0.618083  0.479068 -1.072013 -0.025138
2013-01-05  0.026877  0.287974  0.088980 -0.612962
2013-01-06  0.442643 -1.807780  0.231755 -0.714546

In [27]:
 df.index #index 값 확인

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [28]:
df.columns #columns 값 확인

Index(['A', 'B', 'C', 'D'], dtype='object')

In [29]:
df.values #df 내용 확인

array([[ 1.75877674,  0.46093443,  0.74907517, -0.17313466],
       [-0.51458011, -0.38434237,  0.60097732,  0.72637206],
       [-1.08843977, -1.17228145,  0.66432271,  0.23731558],
       [-0.61808343,  0.4790683 , -1.07201256, -0.02513766],
       [ 0.02687735,  0.28797386,  0.08897959, -0.61296201],
       [ 0.44264285, -1.80778045,  0.23175471, -0.71454631]])

In [35]:
df.info() # df 개요 확인

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [37]:
df.describe() # df 통계적 개요 확인

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.001199 -0.356071  0.210516 -0.093682
std    1.012073  0.954380  0.679492  0.538179
min   -1.088440 -1.807780 -1.072013 -0.714546
25%   -0.592208 -0.975297  0.124673 -0.503005
50%   -0.243851 -0.048184  0.416366 -0.099136
75%    0.338701  0.417694  0.648486  0.171702
max    1.758777  0.479068  0.749075  0.726372

In [40]:
df.sort_values(by='B', ascending=False) # pd 지정 columns을 기준으로 정렬

                   A         B         C         D
2013-01-04 -0.618083  0.479068 -1.072013 -0.025138
2013-01-01  1.758777  0.460934  0.749075 -0.173135
2013-01-05  0.026877  0.287974  0.088980 -0.612962
2013-01-02 -0.514580 -0.384342  0.600977  0.726372
2013-01-03 -1.088440 -1.172281  0.664323  0.237316
2013-01-06  0.442643 -1.807780  0.231755 -0.714546

In [42]:
df

                   A         B         C         D
2013-01-01  1.758777  0.460934  0.749075 -0.173135
2013-01-02 -0.514580 -0.384342  0.600977  0.726372
2013-01-03 -1.088440 -1.172281  0.664323  0.237316
2013-01-04 -0.618083  0.479068 -1.072013 -0.025138
2013-01-05  0.026877  0.287974  0.088980 -0.612962
2013-01-06  0.442643 -1.807780  0.231755 -0.714546

In [44]:
df['A'] #해당 columns를 시리즈로 보여줌

2013-01-01    1.758777
2013-01-02   -0.514580
2013-01-03   -1.088440
2013-01-04   -0.618083
2013-01-05    0.026877
2013-01-06    0.442643
Freq: D, Name: A, dtype: float64

In [48]:
df[0:3] #범위에 맞는 열을 보여줌

                   A         B         C         D
2013-01-01  1.758777  0.460934  0.749075 -0.173135
2013-01-02 -0.514580 -0.384342  0.600977  0.726372
2013-01-03 -1.088440 -1.172281  0.664323  0.237316

In [49]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.514580 -0.384342  0.600977  0.726372
2013-01-03 -1.088440 -1.172281  0.664323  0.237316
2013-01-04 -0.618083  0.479068 -1.072013 -0.025138

In [52]:
df.loc[dates[0]]

A    1.758777
B    0.460934
C    0.749075
D   -0.173135
Name: 2013-01-01 00:00:00, dtype: float64

In [53]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  1.758777  0.460934
2013-01-02 -0.514580 -0.384342
2013-01-03 -1.088440 -1.172281
2013-01-04 -0.618083  0.479068
2013-01-05  0.026877  0.287974
2013-01-06  0.442643 -1.807780

In [56]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.514580 -0.384342
2013-01-03 -1.088440 -1.172281
2013-01-04 -0.618083  0.479068

In [57]:
df.loc['20130102',['A','B']]

A   -0.514580
B   -0.384342
Name: 2013-01-02 00:00:00, dtype: float64

In [58]:
df.loc[dates[0],'A']

1.7587767429102419

In [60]:
df.iloc[3] #loc와 달리 행과 열의번호로 데이터에 접근

A   -0.618083
B    0.479068
C   -1.072013
D   -0.025138
Name: 2013-01-04 00:00:00, dtype: float64

In [61]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.618083  0.479068
2013-01-05  0.026877  0.287974

In [62]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.514580  0.600977
2013-01-03 -1.088440  0.664323
2013-01-05  0.026877  0.088980

In [63]:
df.iloc[1:3,:]

                  A         B         C         D
2013-01-02 -0.51458 -0.384342  0.600977  0.726372
2013-01-03 -1.08844 -1.172281  0.664323  0.237316

In [64]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.460934  0.749075
2013-01-02 -0.384342  0.600977
2013-01-03 -1.172281  0.664323
2013-01-04  0.479068 -1.072013
2013-01-05  0.287974  0.088980
2013-01-06 -1.807780  0.231755

In [65]:
df

                   A         B         C         D
2013-01-01  1.758777  0.460934  0.749075 -0.173135
2013-01-02 -0.514580 -0.384342  0.600977  0.726372
2013-01-03 -1.088440 -1.172281  0.664323  0.237316
2013-01-04 -0.618083  0.479068 -1.072013 -0.025138
2013-01-05  0.026877  0.287974  0.088980 -0.612962
2013-01-06  0.442643 -1.807780  0.231755 -0.714546

In [66]:
df[df.A>0]

                   A         B         C         D
2013-01-01  1.758777  0.460934  0.749075 -0.173135
2013-01-05  0.026877  0.287974  0.088980 -0.612962
2013-01-06  0.442643 -1.807780  0.231755 -0.714546

In [67]:
df[df>0]

                   A         B         C         D
2013-01-01  1.758777  0.460934  0.749075       NaN
2013-01-02       NaN       NaN  0.600977  0.726372
2013-01-03       NaN       NaN  0.664323  0.237316
2013-01-04       NaN  0.479068       NaN       NaN
2013-01-05  0.026877  0.287974  0.088980       NaN
2013-01-06  0.442643       NaN  0.231755       NaN

In [69]:
df2= df.copy() #그냥 = 만 쓰면 데이터 위치만 복사 됨

In [71]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  1.758777  0.460934  0.749075 -0.173135    one
2013-01-02 -0.514580 -0.384342  0.600977  0.726372    one
2013-01-03 -1.088440 -1.172281  0.664323  0.237316    two
2013-01-04 -0.618083  0.479068 -1.072013 -0.025138  three
2013-01-05  0.026877  0.287974  0.088980 -0.612962   four
2013-01-06  0.442643 -1.807780  0.231755 -0.714546  three

In [75]:
df2['E'].isin(['two', 'four']) #데이터 존재 여부로 조건을 검 isin

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [76]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.088440 -1.172281  0.664323  0.237316   two
2013-01-05  0.026877  0.287974  0.088980 -0.612962  four

In [77]:
df

                   A         B         C         D
2013-01-01  1.758777  0.460934  0.749075 -0.173135
2013-01-02 -0.514580 -0.384342  0.600977  0.726372
2013-01-03 -1.088440 -1.172281  0.664323  0.237316
2013-01-04 -0.618083  0.479068 -1.072013 -0.025138
2013-01-05  0.026877  0.287974  0.088980 -0.612962
2013-01-06  0.442643 -1.807780  0.231755 -0.714546

In [79]:
df.apply(np.cumsum) #apply로 특정 함수를 적용 시킬수 있음, np의 cumsum은 누적합을 나타냄

                   A         B         C         D
2013-01-01  1.758777  0.460934  0.749075 -0.173135
2013-01-02  1.244197  0.076592  1.350052  0.553237
2013-01-03  0.155757 -1.095689  2.014375  0.790553
2013-01-04 -0.462327 -0.616621  0.942363  0.765415
2013-01-05 -0.435449 -0.328647  1.031342  0.152453
2013-01-06  0.007194 -2.136428  1.263097 -0.562093

In [80]:
df.apply(lambda x:x.max()-x.min())

A    2.847217
B    2.286849
C    1.821088
D    1.440918
dtype: float64

### 1-4 pandas 이용해서 cctv와 인구 현황 데이터 파악하기

In [81]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [85]:
CCTV_Seoul.sort_values(by='소계', ascending= True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

In [86]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

In [90]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년']+CCTV_Seoul['2015년']+CCTV_Seoul['2014년'])/CCTV_Seoul['2013년도 이전']*100

In [93]:
CCTV_Seoul.sort_values(by='최근증가율',ascending=False).head()

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

In [94]:
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [95]:
pop_Seoul.drop([0], inplace=True) #df의 행을 지움 drop

In [96]:
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [99]:
pop_Seoul['구별'].unique() #반복된 데이터는 하나로 나타내서 한 번이상 나타난 데이터를 확인 하는 것

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

In [100]:
pop_Seoul[pop_Seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

In [101]:
pop_Seoul.drop([26], inplace= True)

In [103]:
pop_Seoul['외국인비율'] = pop_Seoul['외국인']/pop_Seoul['인구수']*100
pop_Seoul['고령자비율'] = pop_Seoul['고령자']/pop_Seoul['인구수']*100
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [104]:
pop_Seoul.sort_values(by='인구수', ascending=False).head()

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
23  강남구  570500.0  565550.0   4950.0  63167.0  0.867660  11.072217
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [105]:
pop_Seoul.sort_values(by='외국인', ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
21   관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291
6   동대문구  369496.0  354079.0  15417.0  54173.0  4.172440  14.661322

In [106]:
pop_Seoul.sort_values(by='외국인비율', ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427

In [107]:
pop_Seoul.sort_values(by='고령자비율', ascending=False).head()

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797

In [108]:
pop_Seoul.sort_values(by='고령자', ascending=False).head()

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
12  은평구  494388.0  489943.0   4445.0  72334.0  0.899091  14.631019
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

### 1-5 pandas 고급 기능 - 두 DataFrame 병합하기

In [109]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                   index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                   index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                    'B': ['B8', 'B9', 'B10', 'B11'],
                    'C': ['C8', 'C9', 'C10', 'C11'],
                    'D': ['D8', 'D9', 'D10', 'D11']},
                   index=[8, 9, 10, 11])

In [110]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [111]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [112]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [113]:
result=pd.concat([df1, df2, df3]) # 데이터를 열방향으로 합치는 것은 concat

In [115]:
result.head(15)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [121]:
result=pd.concat([df1,df2,df3], keys=['x','y','z']) # keys 옵션으로 구분할 수 있고 나중에 다중 index가 되어 level을 형성
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [120]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           codes=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])